{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling8", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling9", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "10"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling10", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_weight", 
      "attr": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_bias", 
      "attr": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attr": {"num_hidden": "4"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "svmoutput1_label", 
      "inputs": []
    }, 
    {
      "op": "SVMOutput", 
      "name": "svmoutput1", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 11, 12, 16, 17, 19], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21
  ], 
  "heads": [[20, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}